<?php 

// +----------------------------------------------------------------------
// | Z-Robot 接口
// +----------------------------------------------------------------------
// | Copyright (c) 2012 http://api.dingxiaoyu.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: xiaoyu <614422099@qq.com>
// +----------------------------------------------------------------------
// //------------------- // 表情代码区 //----------------------- // //

	switch ($Message) {
    case '[Face1.gif]':
        echo "怎么了，怎么不高兴了吗？[Face49.gif]\r\n";
        break;
    case '[Face2.gif]':
        echo " [Face31.gif] 走开色狼、、、、  [Face55.gif]  炸死你。\r\n";
        break;
    case '[Face3.gif]':
        echo " 发什么呆呀，[Face109.gif] 来陪我聊天嘛. \r\n";
        break;
}